Autodesk.Revit.DB.BuiltInFailures.DetailFailures.RepeatingDetailSpacingZeroError
Spacing must be greater than 0

Autodesk.Revit.DB.BuiltInFailures.DetailFailures.NeedsTwoToAlignEaves
At least two Slope Defining Lines are needed to perform Align Eaves.

Autodesk.Revit.DB.BuiltInFailures.DetailFailures.EavesAreAligned
All eaves are already aligned.

Autodesk.Revit.DB.BuiltInFailures.DetailFailures
Failures about Detail.